config/gptel/scope/scope-yaml.org
#+title: Scope YAML Boundary Module — Single Entry Point for YAML <-> Plist Conversion
#+author: Jeff Farr
#+property: header-args:emacs-lisp :tangle scope-yaml.el
#+auto_tangle: y

* Overview

This module consolidates all YAML parsing and key normalization into a single
boundary module. It provides the ONE implementation of:

- Snake_case to kebab-case key normalization
- YAML boolean normalization (:true -> t, :false -> nil, :null -> nil)
- YAML string/file parsing with vector-to-list conversion
- Kebab-case to snake_case reverse conversion for YAML output

All other modules delegate to these functions rather than maintaining
their own copies.

*Loading order:* This module requires ONLY =yaml= and =cl-lib=.
It must NOT require scope-core, scope-shell-tools, or scope-expansion,
because scope-profiles.org and preset-registration.org are loaded
BEFORE those modules.

* Lexical Binding

#+begin_src emacs-lisp
;;; scope-yaml.el --- Scope YAML Boundary Module -*- lexical-binding: t; -*-

;; Copyright (C) 2024-2026 Jeff Farr

;;; Commentary:

;; Single entry point for YAML <-> plist conversion.
;; Consolidates normalize-keys, parse-string, parse-file,
;; and kebab-to-snake into one boundary module.

;;; Code:
#+end_src

* Dependencies

#+begin_src emacs-lisp
(require 'cl-lib)
(require 'yaml)
#+end_src

* Vector Conversion

Convert YAML vectors to lists recursively. The =yaml-parse-string= function
returns vectors for sequences; this converts them to lists for plist compatibility.

#+begin_src emacs-lisp
(defun jf/gptel-scope-yaml--convert-vectors (obj)
  "Convert vectors to lists in OBJ, recursively.
YAML parser returns vectors for sequences; convert to lists for plist compatibility."
  (cond
   ((vectorp obj)
    (mapcar #'jf/gptel-scope-yaml--convert-vectors (append obj nil)))
   ((and (listp obj) (not (null obj)))
    (if (keywordp (car obj))
        ;; Plist: process values
        (let ((result nil))
          (while obj
            (push (car obj) result)
            (push (jf/gptel-scope-yaml--convert-vectors (cadr obj)) result)
            (setq obj (cddr obj)))
          (nreverse result))
      ;; Regular list
      (mapcar #'jf/gptel-scope-yaml--convert-vectors obj)))
   (t obj)))
#+end_src

* Key Normalization

The ONE normalize-keys implementation. Converts snake_case to kebab-case,
normalizes YAML booleans, and recursively processes nested plists.

This consolidates the 4 duplicate implementations from scope-core,
scope-shell-tools, scope-profiles, and preset-registration.

#+begin_src emacs-lisp
(defun jf/gptel-scope-yaml--normalize-keys (plist)
  "Normalize PLIST keys from snake_case to kebab-case.
Also normalizes YAML boolean keywords (:true, :false, :null) to elisp booleans.
Recursively processes nested plists."
  (let ((result nil))
    (while plist
      (let* ((key (car plist))
             (value (cadr plist))
             (normalized-key (intern (replace-regexp-in-string
                                     "_" "-"
                                     (symbol-name key))))
             (normalized-value (cond
                                ;; Nested plist: recurse
                                ((and (listp value)
                                      (not (null value))
                                      (keywordp (car value)))
                                 (jf/gptel-scope-yaml--normalize-keys value))
                                ;; Boolean keywords: normalize
                                ((eq value :true) t)
                                ((or (eq value :false) (eq value :null)) nil)
                                ;; Other values: pass through
                                (t value))))
        (setq result (plist-put result normalized-key normalized-value))
        (setq plist (cddr plist))))
    result))
#+end_src

* Kebab to Snake Case

Reverse conversion for YAML output. Converts kebab-case key to snake_case string.

#+begin_src emacs-lisp
(defun jf/gptel-scope-yaml--kebab-to-snake (key)
  "Convert KEY from kebab-case to snake_case for YAML output.
E.g., :org-roam-patterns becomes org_roam_patterns."
  (replace-regexp-in-string "-" "_" (substring (symbol-name key) 1)))
#+end_src

* Parse YAML String

Parse a YAML string to a normalized plist with vector conversion and key normalization.

#+begin_src emacs-lisp
(defun jf/gptel-scope-yaml--parse-string (yaml-string)
  "Parse YAML-STRING and return normalized plist.
Handles: yaml-parse-string, vector->list conversion, snake_case->kebab-case,
boolean normalization (:true->t, :false->nil, :null->nil)."
  (let* ((parsed (yaml-parse-string yaml-string
                                    :object-type 'plist
                                    :sequence-type 'list))
         (converted (jf/gptel-scope-yaml--convert-vectors parsed)))
    (jf/gptel-scope-yaml--normalize-keys converted)))
#+end_src

* Parse YAML File

Parse a YAML file and return a normalized plist.

#+begin_src emacs-lisp
(defun jf/gptel-scope-yaml--parse-file (file-path)
  "Parse YAML file at FILE-PATH and return normalized plist."
  (with-temp-buffer
    (insert-file-contents file-path)
    (jf/gptel-scope-yaml--parse-string (buffer-string))))
#+end_src

* Schema Defaults

Safe defaults for scope.yml schema.  Missing sections are merged with these defaults.

#+begin_src emacs-lisp
(defconst jf/gptel-scope-yaml--schema-defaults
  '(:paths (:read ()
            :write ()
            :execute ()
            :modify ()
            :deny ())
    :cloud (:auth-detection "warn")
    :security (:enforce-parse-complete t
               :max-coverage-threshold 0.8))
  "Safe defaults for scope.yml schema.
Missing sections in YAML are merged with these defaults.")
#+end_src

* Config Validation

#+begin_src emacs-lisp
(defun jf/gptel-scope-yaml--validate-cloud-config (cloud-plist)
  "Validate CLOUD-PLIST configuration."
  (when cloud-plist
    (let ((auth-detection (plist-get cloud-plist :auth-detection)))
      (unless (member auth-detection '("allow" "warn" "deny"))
        (error "Scope schema: cloud.auth-detection must be \"allow\", \"warn\", or \"deny\", got %S"
               auth-detection))))
  t)

(defun jf/gptel-scope-yaml--validate-security-config (security-plist)
  "Validate SECURITY-PLIST configuration."
  (when security-plist
    (let ((enforce-parse-complete (plist-get security-plist :enforce-parse-complete))
          (max-coverage-threshold (plist-get security-plist :max-coverage-threshold)))
      (when (plist-member security-plist :enforce-parse-complete)
        (setq enforce-parse-complete
              (cond ((eq enforce-parse-complete :true) t)
                    ((or (eq enforce-parse-complete :false)
                         (eq enforce-parse-complete :null)) nil)
                    (t enforce-parse-complete)))
        (unless (or (eq enforce-parse-complete t)
                   (eq enforce-parse-complete nil))
          (error "Scope schema: security.enforce-parse-complete must be boolean, got %S"
                 enforce-parse-complete)))
      (when (plist-member security-plist :max-coverage-threshold)
        (unless (and (numberp max-coverage-threshold)
                    (>= max-coverage-threshold 0.0)
                    (<= max-coverage-threshold 1.0))
          (error "Scope schema: security.max-coverage-threshold must be in [0.0, 1.0], got %S"
                 max-coverage-threshold)))))
  t)
#+end_src

* Load Schema

Load scope.yml and merge with safe defaults.

#+begin_src emacs-lisp
(defun jf/gptel-scope-yaml--load-schema (scope-file)
  "Load scope schema from SCOPE-FILE and merge with defaults.
Returns merged plist with normalized kebab-case keys."
  (let* ((defaults jf/gptel-scope-yaml--schema-defaults)
         (raw (jf/gptel-scope-yaml--parse-file scope-file))
         (normalized (jf/gptel-scope-yaml--normalize-keys raw))
         (paths (plist-get normalized :paths))
         (cloud (plist-get normalized :cloud))
         (security (plist-get normalized :security))
         (bash-tools (plist-get normalized :bash-tools))
         (categories (when bash-tools (plist-get bash-tools :categories))))

    ;; Reject deprecated categories
    (when categories
      (error "bash_tools.categories section no longer supported. Remove categories section, keep only deny list"))

    ;; Merge with defaults
    (let ((merged-paths (if paths
                            (list :read (or (plist-get paths :read) ())
                                  :write (or (plist-get paths :write) ())
                                  :execute (or (plist-get paths :execute) ())
                                  :modify (or (plist-get paths :modify) ())
                                  :deny (or (plist-get paths :deny) ()))
                          (plist-get defaults :paths)))
          (merged-cloud (if cloud
                            (list :auth-detection (or (plist-get cloud :auth-detection)
                                                     (plist-get (plist-get defaults :cloud) :auth-detection))
                                  :allowed-providers (plist-get cloud :allowed-providers))
                          (plist-get defaults :cloud)))
          (merged-security (if security
                               (list :enforce-parse-complete
                                     (if (plist-member security :enforce-parse-complete)
                                         (plist-get security :enforce-parse-complete)
                                       (plist-get (plist-get defaults :security) :enforce-parse-complete))
                                     :max-coverage-threshold
                                     (if (plist-member security :max-coverage-threshold)
                                         (plist-get security :max-coverage-threshold)
                                       (plist-get (plist-get defaults :security) :max-coverage-threshold)))
                             (plist-get defaults :security))))
      (when cloud
        (jf/gptel-scope-yaml--validate-cloud-config merged-cloud))
      (when security
        (jf/gptel-scope-yaml--validate-security-config merged-security))
      (list :paths merged-paths
            :cloud merged-cloud
            :security merged-security
            :bash-tools bash-tools))))
#+end_src

* Provide Feature

#+begin_src emacs-lisp
(provide 'jf-gptel-scope-yaml)
;;; scope-yaml.el ends here
#+end_src
